import React from "react";
import "./Title.scss";

const Title = () => {
    return (
        <div className="Title">
            <h3>
                Завдяки нашій діагностиці ви будете впевнені які у вас причини
                поломки, адже ми вас проведемо по всіх етапах діагностики та
                разом виясним причину неполадок.
            </h3>
            <h4>Для кого діагностика розроблена?</h4>
            <p>
                Наша розробка для людей котрі не знають технічні аспекти та
                терміни, але мають бажання розібратись з проблемою самотужки.
                Також вона підійде для спеціалістів які хочуть пересвідчетись в
                своїх здогадках, але ви мусите розуміти, що терміни спрощенні
                для розуміння задачі людям котрі не знають технічних термінів.
                Наприклад: обертання двигуна замість обертання колінчастотго
                валу і т.д. Якщо у Вас є помічник, скористайтесь його допомогою,
                так буде набагато легше та веселіше.
            </p>
            <h4>Як це виглядатиме?</h4>
            <p>
                Діагностика має вигляд тестів. Для розуміня яку відповідь
                потрібно дати, ми пробували максимально пояснити суть питання в
                інструкціях під ними (рекомендуємо до них заглядати). По
                закінченню діагностики Ви отримаєте результат, де буде описано,
                що варто замінити для усунення проблеми. Власні догадки, що
                вийшло з ладу відкладіть до результатів діагностики, щоб
                підтвердити чи спростуавти їх.
            </p>
            <h4>Умови для виконання:</h4>
        </div>
    );
};

export default Title;
