import React from 'react';
import s from "./DiagnosticBatteryHeader.module.css"

const DiagnosticBatteryHeader = () => {
      return (
            <div>
                  <div className={s.header} >
                        Завдяки нашій діагностиці ви будете впевнені які у вас причини поломки, адже ми вас проведемо по всіх етапах діагностики та разом виясним причину неполадок.
                  </div>

                  <div className={s.explanation}>
                        <h5>Для кого діагностика розроблемна?</h5>
                        <p>Наша розробка для людей котрі не знають технічні аспекти та терміни, але мають бажання розібратись з проблемою  самотужки (з помічником буде набагато легше та веселіше). Також вона підійде для спеціалістів які хочуть пересвідчетись в своїх здогадках, але ви мусите розуміти, що терміни спрощенні для розуміння  задачі людям котрі не знають технічних термінів. Наприклад: обертання двигуна замість обертання колінчастотго валу і т.д.</p>
                        <h5>Як це виглядатиме?</h5>
                        <p>Діагностика має вигляд тестів. Для розуміня яку відповідь потрібно дати, ми пробували максимально пояснити суть питання в інструкціях під ними (рекомендуємо до них заглядати). По закінченню діагностики Ви отримаєте реультат, де буде описано, що варто замінити для усунення проблеми. Власні догадки, що вийшло з ладу відкладіть до результатів діагностики, щоб підтвердити чи спростуавти їх.</p>
                        <h5>Дана діагностика буде обєктивною, якщо Ваш акумулятор свинцевий (Pb). Цієї будови акумулятори мають електроліт який можна перевірити. Діагностику також можна проходити якщо у вас інший акумулятор.</h5>
                        <p>Виберіть діагностику відштовхуючись від того <span className='text-muted2'>як проблема себе проявляє</span>.</p>
                  </div>
            </div>
      );
}

export default DiagnosticBatteryHeader;