import React from 'react';
import './Footer.scss'

const Footer = () => {
    return (
        <footer className="footer">
                    <p >
                        Автосервіс Вініко надає послуги діагностики,
                        професійного ремонту стартера, генератора у Луцьку.
                        Заміна бендиксів, втягуючих реле, статорів, роторів,
                        втулок, щіток, підшипників, регуляторів, діодних мостів,
                        шківів. Продаж стартерів, генераторів. Великий вибір
                        компонентів:статор стартера, статор генератора, бендикс
                        стартера, підшипники до стартерів, втулки стартера,
                        підшипники до генераторів, втягуючі реле, щітки
                        стартера, щітки генератора, якір стартера, якір
                        генератора, регулятор генератора, шків генератора,
                        діодний міст генератора. У нашому асортименті стартера,
                        генератори, компоненти брендів Koyo, ZM, ZEN, IKA,
                        Mobiletron, оригінальні бренди BOSCH, DELCO, DENSO, INA,
                        VALEO. <span>Version: 2.1</span>
                    </p>
            </footer>
    );
}

export default Footer;
